---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.TotalLength
source: html/d1034aa8-b0d4-cabc-54ff-44fbb899e43c.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.TotalLength Property

The length of an individual bar multiplied by Quantity.

## Syntax (C#)
```csharp
public double TotalLength { get; }
```